<?php

use App\Models\StaticPages;
use Illuminate\Database\Seeder;


class StaticPagesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        StaticPages::create(array(
           'name' => 'من نحن',
           'description' => '<h2>لدى حراج بلص نوعان من الحسابات: </h2>

                        <p>
                            <b>حسابات مجانية: </b> وهي متاحة لأي شخص لعرض المنتجات والتواصل مع الزبائن ويتم عرض إعلاناتهم في واجهات الموقع ويكون متاح للظهور في محرك بحث داخلي.
                        </p>

                        <p>
                            <b>حسابات مدفوعة: </b>وهي حسابات تُمكّن التاجر مع عمل متجر للمنتجات خاص فيه مع رابط خاص بعلامته التجارية ليكون بمثابة تجميع لمنتجاته كما يتم عرض إعلانات منتجاته في أماكن أكثر جاذبية داخل الموقع.
                        </p>



                        <h2>الرؤيا والرسالة </h2>

                        <p>
                            <b>شعارنا: </b> هو تسهيل عملية البيع والشراء بين البائع والمشتري، ورؤيتنا هي المساهمة في تعزيز النشاط التجاري في المملكة وتطوير تقنيات جديدة لمواكبة التطورات العالمية مع تقديم أفضل الخدمات التسويقية.
                        </p>


                        <h2>القيم والأهداف </h2>
                        <ul>
                            <li>توفير متعة التسوق.</li>
                            <li>تعزيز النشاط التجاري المتبادل.</li>
                            <li>الالتزام الأخلاقي المهني.</li>
                            <li>مساعدة المستخدمين في سهولة البيع والشراء.</li>
                        </ul>',






        ));

        StaticPages::create(array(
            'name' => 'صفحة سياسة الخصوصية',
            'description' => '

    <h3>الخصوصية وبيان سريّة المعلومات</h3>
                    <p>نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت. لقد تم إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم بتجميعها منكم عند زيارتكم لموقعنا على شبكة الانترنت وكيفية تعاملنا مع هذه البيانات الشخصية. </p>



                    <h3>التصفح </h3>
                    <p> لم نقم بتصميم هذا الموقع من أجل تجميع بياناتك الشخصية من جهاز الكمبيوتر الخاص بك أو من جوالك أثناء تصفحك لهذا الموقع، وإنما سيتم فقط استخدام البيانات المقدمة من قبلك بمعرفتك ومحض إرادتك. </p>




                    <h3> ماذا عن الكوكيز؟ </h3>
                    <p> الكوكيز، والتي هي معروفة بالعالم الرقمي "ملفات تعريف الارتباط" لتشغيل القرص الصلب لجهاز الكمبيوتر من خلال متصفح الويب الخاص بك لتمكين انظمتنا من تخصيص المتصفح الخاص بك وتوفير الكثير من الميزات. عادة ما تقوم معظم المتصفحات بإخبارك
                        عندما تتلقى كوكيز جديدة وترشدك إلى كيفية تعطيلها، ننصحك بعدم تعطيل الكوكيز الخاصة فهي تساعدك في تحقيق الاستفادة الكاملة من المميزات لذا ننصح بتركها مفتوحة.
                    </p>




                    <h3>عنوان بروتوكول شبكة الإنترنت (IP)  </h3>
                    <p>في أي وقت تزور فيه أي موقع انترنت بما فيها هذا الموقع، سيقوم السيرفر المضيف بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك، تاريخ ووقت الزيارة ونوع متصفح الإنترنت الذي تستخدمه والعنوان URL الخاص بأي موقع من مواقع الإنترنت التي تقوم
                        بإحالتك إلى هذا الموقع على الشبكة </p>




                    <h3>عمليات المسح على الشبكة </h3>
                    <p> إن عمليات المسح التي نقوم بها مباشرة على الشبكة تمكننا من تجميع بيانات محددة مثل البيانات المطلوبة منك بخصوص نظرتك وشعورك تجاه موقعنا. تعتبر ردودك ذات أهمية قصوى، ومحل تقديرنا حيث أنها تمكننا من تحسين مستوى موقعنا، ولك كامل الحرية
                        والاختيار في تقديم البيانات المتعلقة باسمك والبيانات الأخرى</p>





                    <h3>إفشاء المعلومات </h3>
                    <p>سنحافظ في كافة الأوقات على خصوصية وسرية كافة البيانات الشخصية التي نتحصل عليها. ولن يتم إفشاء هذه المعلومات إلا إذا كان ذلك مطلوباً بموجب أي قانون أو عندما نعتقد بحسن نية أن مثل هذا الإجراء سيكون مطلوباً أو مرغوباً فيه للتمشي مع القانون،
                        أو للدفاع عن أو حماية حقوق الملكية الخاصة بهذا الموقع أو الجهات المستفيدة منه. </p>





                    <h3> البيانات اللازمة لتنفيذ المعاملات المطلوبة من قبلك </h3>
                    <p>عندما نحتاج إلى أية بيانات خاصة بك، فإننا سنطلب منك تقديمها بمحض إرادتك. حيث ستساعدنا هذه المعلومات في الاتصال بك وتنفيذ طلباتك حيثما كان ذلك ممكنناً. لن يتم اطلاقاً بيع البيانات المقدمة من قبلك إلى أي طرف ثالث بغرض تسويقها لمصلحته
                        الخاصة دون الحصول على موافقتك المسبقة والمكتوبة ما لم يتم ذلك على أساس أنها ضمن بيانات جماعية تستخدم للأغراض الإحصائية والأبحاث دون اشتمالها على أية بيانات من الممكن استخدامها للتعريف بك </p>



                    <h3>عند الاتصال بنا</h3>
                    <p>سيتم التعامل مع كافة البيانات المقدمة من قبلك على أساس أنها سرية. تتطلب النماذج التي يتم تقديمها مباشرة على الشبكة تقديم البيانات التي ستساعدنا في 
                            تحسين موقعنا. سيتم استخدام البيانات التي يتم تقديمها من قبلك في الرد على كافة استفساراتك وملاحظاتك، أو طلباتك من قِبل هذا الموقع أو أيا من المواقع 
                            التابعة له.
                            </p>



                    <h3>إفشاء المعلومات لأي طرف ثالث</h3>
                    <p>لن نقوم ببيع، المتاجرة، تأجير، أو إفشاء أية معلومات لمصلحة أي طرف ثالث خارج هذا الموقع، أو المواقع التابعة له. وسيتم الكشف عن المعلومات فقط في حالة صدور
                            أمر بذلك من قبل أي سلطة قضائية أو تنظيمية.
                           </p>



                
                    <h3>التعديلات على سياسة سرية وخصوصية المعلومات</h3>
                    <p>نحتفظ بالحق في تعديل بنود وشروط سياسة سرية وخصوصية المعلومات إن لزم الأمر ومتى كان ذلك ملائماً. سيتم تنفيذ التعديلات هنا على هذه الصفحة وسيتم بصفة مستمرة إخطارك بالبيانات التي حصلنا عليها، وكيف سنستخدمها والجهة التي سنقوم بتزويدها بهذه البيانات.
                        </p>'




            ));

        StaticPages::create(array(
            'name' => 'شروط الاستخدام',
            'description' => ' <h2>مادة رقم (1): المقدمة</h2>
                    <p>
                        <b>بند رقم (1):</b> تُعتبر هذه المقدمة جزء لا يتجزأ من هذه الاتفاقية. <br>
                        <b>بند رقم (2):</b> إن هذه الاتفاقية بجميع شروطها وبنودها المنشورة على موقع حراج بلص تحت اسم (شروط الاستخدام) وُضِعت لحماية وحفظ حقوق كل من الأطراف التالية: - <br>
                        <strong>الطرف الأول:</strong> مؤسسة حراج بلص التجارية. <br>
                        <strong>الطرف الثاني:</strong> المستخدم الذي يصل إلى الموقع من دون تسجيل. <br>
                        <strong>الطرف الثالث:</strong>العميل المسجل بالموقع المستفيد من الإعلانات. <br>
                        <strong>الطرف الرابع:</strong>المؤسسات الشريكة التي تعلن عبر موقع حراج بلص. <br>
                        <b>بند رقم (3):</b> تم إنشاء هذه الاتفاقية بناء على نظام التعاملات الإلكترونية وتخضع البنود والشروط والأحكام والمنازعات القانونية للقوانين والتشريعات و الأنظمة المعمول بها في المملكة العربية السعودية. <br>
                        <b>بند رقم (4): </b>لكونك مستخدم / عميل / مؤسسة شريكة فإنك توافق على الالتزام بكل ما تحتوي هذه الاتفاقية في حال استخدامك لموقع حراج بلص أو في حال الوصول اليه أو في حالة التسجيل في أي خطة من الحسابات المتاحة في موقع حراج بلص. <br>
                        <b> بند رقم (5): </b>يحق لحراج بلص التعديل على هذه الاتفاقية في أي وقت دون الرجوع إلى مستخدمي موقع حراج بلص والتعديل يُعتبر ملزم لجميع الأطراف، لذلك ننصح بمتابعة هذه الاتفاقية بشكل مستمر. <br>
                        <b>بند رقم (6):</b> إن هذه الاتفاقية ملزمة لكل من استخدم موقع حراج بلص. <br>
                    </p>

                    <h2>مادة رقم (2): شروط الاستخدام</h2>

                    <p>
                        يلتزم كل من الطرف الثاني والطرف الثالث والطرف الرابع بالبنود التالية: - <br>
                        <b>بند رقم (1):</b> عدم الإعلان أو تحميل محتوى أو عناصر غير ملائمة للتصنيفات المتاحة في الموقع والمسموح ببيعها. <br>
                        <b>بند رقم (2):</b> مراجعة شروط الإعلان والسلع الممنوعة. <br>
                        <b>بند رقم (3):</b> عدم الاختراق أو التحايل على قوانين وسياسة وأنظمة الموقع أو أي حقوق تتعلق بطرف ءاخر. <br>
                        <b>بند رقم (4):</b> عدم استخدام تقنية Drop Shipping وعرض أي سلعة للبيع من غير تملكها. <br>
                        <b>بند رقم (5):</b> عدم عرض سلع للبيع غير قادر على تسليمها. <br>
                        <b>بند رقم (6):</b> عدم استخدام أي وسيلة غير مصرح بها للوصول للإعلانات أو لبيانات المستخدمين الآخرين أو انتهاك لسياسة وحقوق الطرف الأول، أو الوصول لمحتوى موقع حراج بلص أو تجميع وتحصيل معلومات وبيانات تخص موقع حراج بلص ومستخدميه
                        والاستفادة منها بأي شكل من الأشكال أو إعادة نشرها. <br>
                        <b>بند رقم (7):</b> يمنع استخدام موقع حراج بلص بأي وسيلة كانت في حال تعرضك للحجب المؤقت أو الدائم إلا بموافقة خطية من إدارة موقع حرج بلص. <br>
                        <b>بند رقم (8): </b> عدم التلاعب بأسعار السلع سواء في البيع أو الشراء وإلحاق الضرر بالمستخدمين الآخرين.<br>
                        <b> بند رقم (9): </b> عدم نشر إعلانات أو تعليقات كاذبة أو غير دقيقة أو مضللة أو خادعة أو قذف أو تشهير <br>
                        <b>بند رقم (10):</b> عدم التعرض للسياسات أو السيادات الدولية أو الشخصيات المعتبرة أو أي نقاشات لا تتعلق بالبيع والشراء المشروعة في موقع حراج بلص.<br>
                        <b>بند رقم (11):</b>عدم انتهاك حقوق العلامات التجارية، وبراءات الاختراع، والدعاية وقواعد البيانات أو غيرها من حقوق الملكية التي تنتمي للطرف الأول. <br>
                        <b>بند رقم (12):</b> عدم انتهاك حقوق الآخرين الملكية أو براءة الاختراع. <br>
                        <b>بند رقم (13):</b> عدم انتحال صفة الطرف الأول أو موقع حراج بلص أو ممثل لها أو موظف فيها أو أي صفة توحي بأنك تابع للطرف الأول ما لم يكون لديك أذن رسمي من الطرف الأول. <br>
                        <b>بند رقم (14):</b> يُمنع استخدام هذه الخدمة من قِبل أي مستخدم غير بشري ويستثنى من ذلك المستخدمين الغير بشريين التابعين للشركات التالية فقط: Google- Facebook- Twitter <br>
                    </p>

                    <h2>مادة رقم (3): مسؤولية الطرف الأول (مؤسسة حراج بلص التجارية)</h2>



                    <p>
                        <b>بند رقم (1):</b> يقدم الطرف الأول خدمة تمكين المستخدم من عرض سلعته وفق لمواد هذه الاتفاقية. <br>
                        <b>بند رقم (2):</b> لا يتحمل الطرف الأول المسؤولية عن أي مخاطرة أو أضرار أو تبعات أو خسائر تقع على البائع أو المشتري أو أي طرف آخر وعلى من لحق به الضرر إبلاغنا بذلك من خلال رابط اتصل بنا أو لوحة الدعم الفني وشرح الضرر الواقع عليه
                        وسيقوم الطرف الأول باتخاذ الإجراء حسب نوع الواقعة دون أي مسؤولية. <br>
                        <b>بند رقم (3):</b> إن استخدامك لموقع حراج بلص يعني أنك تخولنا في حفظ بياناتك التي قمت بإدخالها بالخوادم التابعة للطرف الأول ولنا حق الاطلاع عليها ومراجعتها. <br>
                        <b>بند رقم (4):</b> الموافقة على أحقيته الطرف الأول في مراقبة الرسائل الخاصة عند الحاجة لضمان خلوها من مخالفات هذه الاتفاقية. <br>
                        <b>بند رقم (5):</b> للطرف الأول الحق في تزويد بيانات مستخدمين موقع حراج بلص فقط للجهات الحكومية المختصة في حال الطلب وفقاً للقواعد القانونية المتبعة في المملكة العربية السعودية. <br>
                        <b>بند رقم (6):</b> للطرف الأول الحق في حذف الإعلان والتصرف بالصور المرفقة عند وجود مخالفات تنص عليها هذه الاتفاقية. <br>
                        <b>بند رقم (7):</b> تعتبر تعاميم وقرارات وتوجيهات إدارة ومشرفي موقع حراج بلص ملزمة للطرف الثاني والطرف الثالث والطرف الرابع بعد إيصالها له عبر الرسائل الخاصة بموقع حراج بلص أو الجوال أو البريد الإلكتروني أو عبر نظام الإشعارات،
                        وعليه الالتزام بها والعمل بموجبها. <br>



                        <h2>مادة رقم (4): شروط العضو</h2>

                        <p>
                            العضوية هي: اسم المستخدم الذي سجل به الشخص في موقع حراج بلص والتي ترتبط برقم جواله أو بالبريد الإلكتروني أو بحساب تواصل اجتماعي خلص به، ويجب أن تكون خاضعة للشروط التالية: <br>
                        </p>
                        <ul>
                            <li>يلزم اختيار اسم لائق ومناسب خلال عملية التسجيل</li>
                            <li>يُمنع استخدام أكثر من عضوية في الموقع لكل شخص أو جهة إلا إن كان الشخص لديه عدة علامات تجارية ويحتاج إلى إنشاب حساب لكل علامة تجارية. يجب ان تقوم بتحديث رقم جوالك المرتبط بالعضوية في حال تغيير رقم جوالك أو فقدانه.</li>
                            <li>إذا كان اسم عضويتك يحتوي على اسم تجاري أو علامة تجارية، يجب أن تكون المالك للعلامة التجارية أو مخول لك باستخدام الاسم أو العلامة التجارية.</li>
                            <li>يلتزم "موقع حراج بلص" باتخاذ المعايير اللازمة لحماية البيانات وحفظها، علماً بأن شبكة الانترنت ليست وسيلة آمنة بنسبة 100٪ لحفظ المعلومات السرية. (راجع صفحة سياسة الخصوصية).</li>
                            <li>يستخدم موقع حراج بلص برامج احصائية مثل Google Analytics وذلك لأجل تطوير الخدمة وتحسينها.</li>
                            <li>لا يطلب الطرف الأول من الأطراف الأخرى كلمة مرور الحساب في أي ظرف. </li>
                        </ul>



                        <h2>مادة رقم (5): شروط إضافة المحتوى لموقع حراج بلص</h2>



                        <p>

                            <b>بند رقم (1):</b> مادة رقم (5): شروط إضافة المحتوى لموقع حراج بلص<br>
                            <b>بند رقم (2):</b>تتعهد بعدم اضافة أي ردود ممنوعة. <br>
                            <b>بند رقم (3):</b> تتعهد بعدم ارسال أي رسائل ممنوعة. <br>
                            <b>بند رقم (4):</b> تتعهد بتحديد سعر بيع السلعة المُعلن عنها.<br>
                            <b>بند رقم (5):</b> تتعهد بمتابعة إعلانك والرد على استفسارات العملاء من خلال الردود أو من خلال الرسائل الخاصة. <br>
                            <b>بند رقم (6):</b> تتعهد بعدم عمل إعلانات مكررة.<br>
                            <b>بند رقم (7):</b> يلزم أن تكون المادة الإعلانية المعلن عنها سلعة أو خدمة فقط. <br>
                            <b>بند رقم (8): </b> يجب أن يكون الإعلان كامل التفاصيل وفي القسم الصحيح. <br>
                            <b> بند رقم (9): </b>يحق لإدارة موقع حراج بلص حذف أي إعلان من دون ذكر سبب الحذف. <br>
                            <b> بند رقم (10): </b> إذا كنت تقدم خدمة أو تبيع سلعة تحتاج تصريح، يجب أن يكون لديك التصاريح اللازمة لذلك. <br>
                            <b> بند رقم (11): </b> يلتزم المعلن بأن تكون الصور المضافة في الإعلان لنفس السلعة المعلن عنها.<br>
                            <b> بند رقم (12): </b> صور المحتوى يجب أن تكون لائقة أخلاقيا وذات جودة عالية ولا تخالف نظام وزارة العمل أو حقوق الإنسان أو أي جهة حكومية أو خاصة. <br>
                            <b> بند رقم (13): </b>يجب الالتزام بعدم الإعلان عن السلع والخدمات التي تندرج في قائمة السلع والخدمات الممنوعة. <br>
                            <b> بند رقم (14): </b> يجب الالتزام بقائمة الردود الممنوعة و الرسائل الممنوعة.<br>
                        </p>

                        <h2>مادة رقم (6): السياسة الأمنية لمؤسسة حراج بلص التجارية</h2>
                        <p>
                            تلتزم مؤسسة حراج بلص التجارية باتفاقية الاستخدام وسياسة الخصوصية ولكننا لسنا طرفا في أي خلاف أو قضايا تنشأ بين المستخدمين لمخالفة أحدهما أو كلاهما اتفاقية الاستخدام إلا أنه يسعى لتعزيز الجانب الأمني في موقع حراج بلص وذلك للحد والقضاء على التعديات التي
                            يقوم بها بعض من مستخدمي موقع حراج بلص بشكل يخالف اتفاقية شروط الاستخدام وسياسة الخصوصية وذلك تحقيقا لنزاهة البيع والشراء ومحاربة النصب والاحتيال والغش والخداع وإتباع للقوانين والتشريعات والتنظيمات المتبعة في المملكة العربية
                            السعودية وبذلك فإنه يحق لمؤسسة حراج بلص التجارية اتخاذ الإجراء اللازم تجاه أي فرد أو مؤسسة أو شركة خالفت هذه الاتفاقية علماً أنه قد يصل الإجراء إلى الملاحقة القانونية والقضائية أمام الجهة ذات العلاقة. ونورد هنا المخالفات الشائعة
                            والإجراء اللازم تجاهها:
                        </p>
                        <ul>
                            <li>تعرض العميل لعملية نصب واحتيال من قبل طرف آخر: يجب على العميل إبلاغ الجهات الأمنية المختصة وتعبئة نموذج الشكوى الخاص بذلك في صفحة اتصل بنا، ستقوم إدارة موقع حراج بلص بمراجعة الشكوى والتحري حول العميل المدعى عليه وسيتم اتخاذ
                                الإجراء اللازم في حقه في حال تم التأكد بأنه خالف اتفاقية الاستخدام، ولن يكون موقع حراج بلص طرف في مثل هذه القضايا ولا يتحمل أي مسئولية ولكننا سنقدم ما لدينا للجهات المختصة في حال تم طلب ذلك بصفة رسمية.</li>
                            <li>التعدي على سياسة أو سيادة الدولة: سيتم حذف الإعلان وإيقاف عضوية المعلن وإبلاغ الجهات المختصة بذلك.</li>
                            <li> في حال الإعلان عن أي من السلع الممنوعة: سيتم توثيق وأرشفة الإعلان وحذفه وإيقاف العضو وإبلاغ الجهات ذات الاختصاص.</li>
                            <li>في حال قام فرد أو مؤسسة أو شركة بطريق غير مشروعة (كاختراق أو استخدام وسائل تجميع البيانات غير المشروعة أو أي وسيلة كانت) بهدف الوصول إلى محتوى الموقع أو برمجة الموقع أو قواعد البيانات الخاصة بالموقع أو المعلومات والبيانات التي
                                تخص عملاء الموقع بغية نسخ الإعلانات وإعادة نشرها أو الاستفادة منها بأي شكل من الأشكال. فإن مؤسسة حراج بلص التجارية ستتوجه للجهات المختصة لمقاضاة الطرف الآخر بدعوى الاختراق الإلكتروني وارتكاب جريمة مخالفة أنظمة الجرائم المعلوماتية</li>
                            <li>التعدي على حقوق الملكية، أو الفكرية، أو براءة الاختراع لطرف ثالث: إن كنت تعتقد بأنه تم التعدي على حق من حقوقك فعليك تعبئة نموذج الشكوى الخاص بالتعدي على الحقوق وتقديم ما يثبت التعدي في الإعلان المنشور. ستقوم مؤسسة حراج بلص
                                التجارية بمراجعة الشكوى ودراستها والتأكد من صحتها وسيتخذ الإجراء اللازم بحسب النتيجة، عليك التوجه للجهات ذات الاختصاص في حال رغبتك في مقاضاة الطرف الذي اعتدى على حقوقك، علماً أن مؤسسة حراج بلص التجارية لن تكون طرف في القضية
                                وليست مسئولة عنها ولا نتحمل أي مسئولية.</li>
                            <li>في حال قام الطرف الثاني أو الطرف الثالث أو الطرف الرابع بالتقييم الكاذب لعضو ءاخر سيتم إيقاف العضوين ومنعهم من استخدام الموقع في حال اتضح التعاون بينهم، وسيتم اتخاذ الإجراءات اللازمة لأي تبعات حدثت بسبب هذا التقييم.</li>
                            <li>التعرض للتشهير وانتهاك الخصوصية: على العميل تعبئة نموذج الشكوى الخاص بذلك، ستقوم إدارة موقع حراج بلص بمراجعة الشكوى والتحري حول العميل المدعى عليه وسيتم اتخاذ الإجراء اللازم في حقه وفي حال تم التأكد بأنه خالف اتفاقية الاستخدام،
                                على العميل الذي لحق به الضرر التوجه للجهات ذات العلاقة لتقديم الشكوى، لن تكون مؤسسة حراج بلص التجارية طرف في مثل هذه القضايا ولا تتحمل أي مسئولية ولكننا سنقدم البيانات اللازمة للجهات المختصة في حال تم طلب ذلك بصفة رسمية.</li>
                            <li>الإزعاج: عند تعرض عميل ما للإزعاج من قبل عميل ءاخر فعليه إشعار الموقع بذلك وسيتم مراجعة الشكوى واتخاذ الإجراء المناسب حيال ذلك.</li>
                        </ul>

'








            )
        );

        StaticPages::create(array(
            'name' => 'سياسة دفع العمولة',
            'description' => '<h2>الشروط والأحكام</h2>
                    <p>
                        عمولة حراج هي العمولة المتفق عليها في سياسة استخدام الموقع والموضح آليتها في صفحة عمولة حراج. يجب أن تكون العمولة متعلقة بسلعة من السلع المسموح بيعها في الموقع ، وفي حالة مخالفتك لذلك فإن المستخدم الذي قام بتحويل العمولة يتحمل كامل المسؤولية أمام الجهات
                        المختصة. <br> - يتم دفع العمولة إما عن طريق التحويل البنكي أو الدفع الإلكتروني عن طريق ( مدى ). <br> - في حالة التحويل البنكي عليك تعبئة نموذج إثبات التحويل بعد إتمام عملية التحويل وسيقوم الموقع بالتأكد
                        من عملية التحويل واتخاذ الإجراء اللازم. <br>
                    </p>
                
                    <h2>
                        خدمة الدفع الإلكتروني ( مدى ):
                    </h2>
                    <p>
                        في حالة الدفع عن طريق الانترنت (مدى) سيستلم العميل إشعارا على الشاشة فور قبول عملية الدفع. لانتحمل أي مسؤولية لو تم رفض عملية الدفع أو إلغائها من قبل مزود خدمة البطاقة الإئتمانية لأي سبب من الأسباب. يجب عليك التأكد من البنك المزود لخدمة البطاقة الإئتمانية
                        عن سبب الرفض.
                    </p>
                
               
                    <h2>سياسية الخصوصية والأمان :</h2>
                    <p>نود التأكيد بأنه لا يتم تخزين معلومات بطاقتك الإئتمانية على موقعنا الإلكتروني .إن جميع المعلومات والتفاصيل الخاصة بالبطاقة الإئتمانية التي تقوم بإدخالها تتم من خلال بوابة الدفع الإلكترونية والمستقلة تماما عن موقعنا الإلكتروني ،ومعتمدة من مصرف الراجحي حيث تم  يتم تشفير تلك المعلومات بغرض الحماية الأمنية، ويتم أيضا تشفير المراسلات المتداولة من و إلى موقع مقدم الخدمة. <br>
                        - لانقوم بتقديم أي من معلومات الدفع التي تمت عن طريق الموقع إلى شركات أخرى أو جهات فردية إلا إذا تم طلبها من قبل جهة رسمية قانونية.  <br>
                        - يجب عليك التأكد من معلومات البطاقة الائتمانية أو بطاقة مدى المستخدمة في الدفع بأن تكون صحيحة ودقيقة و سارية المفعول ، ويجب عليك استخدام البطاقة <br>
                        الإئتمانية التابعة قانونيا لك. لن يتم استخدام أو مشاركة معلوماتك الشخصية من قبل الخدمات الإلكترونية مع أي طرف ثالث ويستثنى من ذلك التحقق من شرعية المعلومات وعدم تزويرها أو عند طلبها من الجهات الرسمية . لن تكون خدمة الموقع الإلكتروني (أونلاين) مسؤولة بأي شكل من الأشكال عن تزوير البطاقات الائتمانية. سيتم تحميلك كافة المسؤولية عن استخدامك بطاقات إئتمانية مزورة وستكون مسؤولا بشكل كامل عن اثبات خلاف ذلك. <br>
                        - إن استخدامك لخدمة الدفع الإلكتروني (أونلاين) لموقعنا الإلكتروني هو بمثابة موافقة ضمنية لالتزامك بهذه الشروط .في حال عدم موافقتك لأي بند من بنود هذه الشروط فنرجوا منك عدم استخدام هذه الخدمة. <br>

                    </p>
                    
                        <h2>الإسترجاع والتبديل</h2>
                        <p> مؤسسة حراج للتسويق الإلكتروني  لا تمارس نشاط البيع أو الشراء بل يقتصر نشاطها على التسويق الإلكتروني فقط حيث تمكن المستخدم من إنشاء ونشر إعلاناته وفق الضوابط والشروط المحددة في معاهدة استخدام الموقع. لذلك فإن اتفاقية البيع والشراء وخدمات ما بعد البيع وما يلحق بها من تبعات تقتصر مسؤوليتها على البائع  والمشتري.</p>',






        ));


        StaticPages::create(array(
            'name' => 'الباقات',
            'description' => '
            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى ، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            '





        ));

        StaticPages::create(array(
            'name' => 'الأسئلة الشائعة',
            'description' => '<h2>لدى حراج بلص نوعان من الحسابات: </h2>
 
                         <p>
                             <b>حسابات مجانية: </b> وهي متاحة لأي شخص لعرض المنتجات والتواصل مع الزبائن ويتم عرض إعلاناتهم في واجهات الموقع ويكون متاح للظهور في محرك بحث داخلي.
                         </p>
 
                         <p>
                             <b>حسابات مدفوعة: </b>وهي حسابات تُمكّن التاجر مع عمل متجر للمنتجات خاص فيه مع رابط خاص بعلامته التجارية ليكون بمثابة تجميع لمنتجاته كما يتم عرض إعلانات منتجاته في أماكن أكثر جاذبية داخل الموقع.
                         </p>
 
 
 
                         <h2>الرؤيا والرسالة </h2>
 
                         <p>
                             <b>شعارنا: </b> هو تسهيل عملية البيع والشراء بين البائع والمشتري، ورؤيتنا هي المساهمة في تعزيز النشاط التجاري في المملكة وتطوير تقنيات جديدة لمواكبة التطورات العالمية مع تقديم أفضل الخدمات التسويقية.
                         </p>
 
 
                         <h2>القيم والأهداف </h2>
                         <ul>
                             <li>توفير متعة التسوق.</li>
                             <li>تعزيز النشاط التجاري المتبادل.</li>
                             <li>الالتزام الأخلاقي المهني.</li>
                             <li>مساعدة المستخدمين في سهولة البيع والشراء.</li>
                         </ul>',
 
 
 
 
 
 
         ));



    }


}
